closedTank_fine/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1906                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

6
(
    front
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          10000;
        startFace       19800;
    }
    back
    {
        type            wedge;
        inGroups        1(wedge);
        nFaces          10000;
        startFace       29800;
    }
    tankWall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       39800;
    }
    top
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       39900;
    }
    bottom
    {
        type            wall;
        inGroups        1(wall);
        nFaces          100;
        startFace       40000;
    }
    axis
    {
        type            empty;
        inGroups        1(empty);
        nFaces          0;
        startFace       40100;
    }
)

// ************************************************************************* //
